//
//                       _oo0oo_
//                      o8888888o
//                      88" . "88
//                      (| -_- |)
//                      0\  =  /0
//                    ___/`---'\___
//                  .' \\|     |// '.
//                 / \\|||  :  |||// \
//                / _||||| -:- |||||- \
//               |   | \\\  -  /// |   |
//               | \_|  ''\---/''  |_/ |
//               \  .-\__  '-'  ___/-. /
//             ___'. .'  /--.--\  `. .'___
//          ."" '<  `.___\_<|>_/___.' >' "".
//         | | :  `- \`.;`\ _ /`;.`/ - ` : | |
//         \  \ `_.   \_ __\ /__ _/   .-` /  /
//     =====`-.____`.___ \_____/___.-`___.-'=====
//                       `=---='
//
//
//     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//
//               佛祖保佑         永无BUG
//
//

#pragma once
#include<iostream>
#include<string>
#include<windows.h>
#include<Mmsystem.h>
#pragma comment(lib,"winmm.lib")
using namespace std;

/* 设置文字前景色和背景色 */
/****************************************************************************************************************************
	* 0-黑色，1-蓝色，2-绿色，3-浅绿色，4-红色，5-紫色，6-黄色，7-白色，8-灰色
	* 9-淡蓝色，10-淡绿色，11-淡浅绿色，12-淡红色，13-淡紫色，14-淡黄色，15-亮白色
	**************************************************************************************************************************/
void SetColor(int foreColor, int backColor);

void hide_cursor();//隐藏光标

void show_cursor();//显示光标

void SetPosition(int x, int y);//设置坐标 

void printByxy(int x, int y, string msg);// 打印文字

void printByxy(int x, int y, int num);// 打印数字

void Clear(int x, int y, int rowCount, int a);//从下x,y开始清rowCount行,每行清理a个长度
